{
  "countries": [
    {
      "id": 1,
      "name": "Australia",
      "cities": [
        {
          "name": "Sydney, Australia",
          "imageUrl": "https://images.unsplash.com/photo-1506973035872-a4ec16b8e8d9?w=800",
          "description": "A vibrant city known for its iconic Opera House, stunning harbor, and beautiful beaches. Experience world-class dining, cultural attractions, and the famous Bondi Beach."
        },
        {
          "name": "Melbourne, Australia",
          "imageUrl": "https://images.unsplash.com/photo-1514395462725-fb4566210144?w=800",
          "description": "A cultural hub famous for its coffee culture, street art, diverse cuisine, and Victorian architecture. Explore hidden laneways and vibrant neighborhoods."
        }
      ]
    },
    {
      "id": 2,
      "name": "Japan",
      "cities": [
        {
          "name": "Tokyo, Japan",
          "imageUrl": "https://images.unsplash.com/photo-1540959733332-eab4deabeeaf?w=800",
          "description": "A bustling metropolis blending ultramodern neon-lit skyscrapers with historic temples. Experience cutting-edge technology, amazing cuisine, and rich traditions."
        },
        {
          "name": "Kyoto, Japan",
          "imageUrl": "https://images.unsplash.com/photo-1493976040374-85c8e12f0c0e?w=800",
          "description": "Famous for its classical Buddhist temples, stunning gardens, imperial palaces, and traditional geisha districts. A glimpse into Japan's ancient capital."
        }
      ]
    },
    {
      "id": 3,
      "name": "Brazil",
      "cities": [
        {
          "name": "Rio de Janeiro, Brazil",
          "imageUrl": "https://images.unsplash.com/photo-1483729558449-99ef09a8c325?w=800",
          "description": "Famous for its breathtaking beaches, Christ the Redeemer statue, and vibrant Carnival celebrations. Enjoy samba, stunning mountain views, and lively culture."
        },
        {
          "name": "São Paulo, Brazil",
          "imageUrl": "https://images.unsplash.com/photo-1548963670-aaaa8f73a5e3?w=800",
          "description": "South America's largest city offering world-class museums, diverse neighborhoods, exceptional dining, and a thriving arts scene."
        }
      ]
    }
  ],
  "temples": [
    {
      "id": 1,
      "name": "Angkor Wat, Cambodia",
      "imageUrl": "https://images.unsplash.com/photo-1590523278191-995cbcda646b?w=800",
      "description": "The largest religious monument in the world, this ancient temple complex showcases stunning Khmer architecture and intricate stone carvings. A UNESCO World Heritage site built in the 12th century."
    },
    {
      "id": 2,
      "name": "Taj Mahal, India",
      "imageUrl": "https://images.unsplash.com/photo-1564507592333-c60657eea523?w=800",
      "description": "An ivory-white marble mausoleum and symbol of eternal love. This architectural masterpiece features stunning gardens, intricate inlay work, and represents the finest Mughal architecture."
    },
    {
      "id": 3,
      "name": "Borobudur, Indonesia",
      "imageUrl": "https://images.unsplash.com/photo-1555993539-1732b0258235?w=800",
      "description": "The world's largest Buddhist temple, featuring nine stacked platforms topped by a central dome. This 9th-century monument is adorned with 2,672 relief panels and 504 Buddha statues."
    },
    {
      "id": 4,
      "name": "Golden Temple, India",
      "imageUrl": "https://images.unsplash.com/photo-1595815771614-ade9d652a65d?w=800",
      "description": "Also known as Harmandir Sahib, this stunning Sikh gurdwara features gold-plated architecture surrounded by a sacred pool. A symbol of equality and spiritual enlightenment."
    }
  ],
  "beaches": [
    {
      "id": 1,
      "name": "Bora Bora, French Polynesia",
      "imageUrl": "https://images.unsplash.com/photo-1589197331516-6617dae0e180?w=800",
      "description": "A tropical paradise featuring crystal-clear turquoise waters, overwater bungalows, and stunning coral reefs. Perfect for snorkeling, diving, and romantic getaways in luxury resorts."
    },
    {
      "id": 2,
      "name": "Maldives",
      "imageUrl": "https://images.unsplash.com/photo-1514282401047-d79a71a590e8?w=800",
      "description": "An archipelago of pristine white-sand beaches, crystal-clear waters, and vibrant marine life. Experience luxury resorts, world-class diving, and breathtaking sunsets in this island paradise."
    },
    {
      "id": 3,
      "name": "Copacabana Beach, Brazil",
      "imageUrl": "https://images.unsplash.com/photo-1483729558449-99ef09a8c325?w=800",
      "description": "One of the world's most famous beaches, featuring a 4km stretch of golden sand, vibrant beach culture, and stunning mountain backdrop. Enjoy beach volleyball, samba, and lively atmosphere."
    },
    {
      "id": 4,
      "name": "Bondi Beach, Australia",
      "imageUrl": "https://images.unsplash.com/photo-1506973035872-a4ec16b8e8d9?w=800",
      "description": "Sydney's iconic beach known for excellent surfing, coastal walks, trendy cafes, and vibrant beach culture. Features stunning coastal scenery and crystal-clear waters."
    }
  ]
}
